{
  "read_lbl_help": "COMANDO READ\n\n\n---- DESCRIZIONE ----\n\nINDICA TUTTI I LAYER CONTENUTI IN UN FILE PIXIL\n\n\n----- PARAMETRI (1) -----\n\n1 - FILE SORGENTE - FILE PIXIL DA CUI LEGGERE TUTTI I LAYER. IL FILE VIENE CERCATO NELLA CARTELLA SOURCE",
  "gen_lbl_help": "COMANDO GEN\n\n\n---- DESCRIZIONE ----\n\nGENERA UN'IMMAGINE UTILIZZANDO UN FILE PIXIL COME BASE DA CUI LEGGERE TUTTI I LAYERE UN FILE JSON COME TEMPLATE PER FILTRARE TUTTI I LAYER PRESENTI NEL FILE SORGENTE. QUESTI FILE PERMETTONO DI DEDICERE QUALI COMBINAZIONI SI POSSONO VERIFICARE DURANTE LA GENERAZIONE DELL'IMMAGINE. IL FILE FINALE VIENE INSERITO NELLA CARTELLA GEN\n\n\n----- PARAMETRI (2) -----\n\n1 - FILE SORGENTE - FILE PIXIL DA CUI LEGGERE TUTTI I LAYER. IL FILE VIENE CERCATO NELLA CARTELLA SOURCE\n\n2 - TEMPLATE JSON - FILE JSON DA UTILIZZARE PER FILTRARE I LAYER CONTENUTI NEL FILE SORGENTE. IL FILE VIENE CERCATO NELLA CARTELLA TEMPLATE",
  "merge_lbl_help": "COMANDO MERGE\n\n\n---- DESCRIZIONE ----\n\nUNISCE I LAYER DI DUE FILE PIXIL IN UN UNICO FILE PIXIL, AGGIUNGE AD UN FILE BASE I LAYER CONTENUTI NEL FILE DA UNIRE. HA BISOGNO DI SAPERE IN QUALE POSIZIONE INSIRIRE I FILE.\n\nESEMPIO:\nSE VIENE INDICATO 5, I LAYER AGGIUNTIVI VERRANNO MESSI DALLA POSIZIONE 5 (COMPRESA) IN POI.\n\nIL FILE TEMPORANEO GENERATO DAL MERGIA FILE VIENE INSERITO NELLA CARTELLA WORKDIR. IL FILE FINALE GENERATO DALLA CONFERMA DEL MERGE VIENE INSERITO NELLA CARTELLA SOURCE\n\n\n----- PARAMETRI (3) -----\n\n1 - FILE BASE - FILE PIXIL BASE AL QUALE AGGIUNGERE I LAYER. IL FILE VIENE CERCATO NELLA CARTELLA SOURCE\n\n2 - FILE AGGIUNTIVO - FILE PIXIL CHE CONTINE I LAYER DA AGGIUNGERE AL FILE BASE. IL FILE VIENE CERCATO NELLA CARTELLA SOURCE\n\n3 - POSZIONE DI INSERIMENTO - NUMERO CHE INDICA DA QUALE POSIZIONE INZIARE AD INSIRIRE I LAYER NEL FILE BASE",
  "ext_lbl_help": "COMANDO EXT\n\n\n---- DESCRIZIONE ----\n\nESTRAE DEI LAYER DA UN FILE PIXIL, PER OGNI ELEMENTO ESTRATTO VIENE RIPORTATO IL NUMERO DEL LAYER NEL FILE ORIGINALE. SE TUTTI I LAYER ESTRATTI HANNO NUMERI CONSECUTIVI SIGNIFICA CHE SI POTRANNO RIMERGIARE DIRETTAMENTE. SE I FILE ESTRATTI NON HANNO TUTTI NUMERI CONSECUTIVI SI DOVRANNO GENERARE PIU' FILE PER IL MERGE. NEL FILTRO PER L'ESTRAZIONE SI POSSONO UTILIZZARE ESPRESSIONI REGOLARI.\n\nESEMPI:\n.*BTC ESTRAE TUTTE LE RISORSE CHE TERMIANO CON BTC\nVE.* ESTARE TUTTE LE RISORSE CHE INIZIANO CON VE\nVE.*BTC ESTARE TUTTE LE RISORSE CHE INIZIANO\nCON VE E TERMINANO CON BTC\n\nIL FILE FINALE VIENE INSERITO NELLA CARTELLA WORKDIR.\n\n\n----- PARAMETRI (2) -----\n\n1 - FILE SORGENTE - FILE PIXIL DA CUI ESTRARRE I LAYER. IL FILE VIENE CERCATO NELLA CARTELLA SOURCE\n\n2 - FILTRO PER ESTRAZIONE - LISTA DI ESPRESSIONI SEPARTE DA VIRGOLA UTILIZZATE PER FILTRARE I LAYER DEL FILE SORGENTE\nESEMPIO: VE.*,CPC.*,OCH.*",
  "del_lbl_help": "COMANDO DEL\n\n\n---- DESCRIZIONE ----\n\nCANCELLA DEI LAYER DA UN FILE PIXIL, NEL FILTRO PER L'ESTRAZIONE SI POSSONO UTILIZZARE ESPRESSIONI REGOLARI.\n\nESEMPI:\n.*BTC ELIMINA TUTTE LE RISORSE CHE TERMIANO CON BTC\nVE.* ELIMINA TUTTE LE RISORSE CHE INIZIANO CON VE\nVE.*BTC ELIMINA TUTTE LE RISORSE CHE INIZIANO\nCON VE E TERMINANO CON BTC\n\nIL FILE FINALE VIENE INSERITO NELLA CARTELLA WORKDIR.\n\n\n----- PARAMETRI (2) -----\n\n1 - FILE SORGENTE - FILE PIXIL DA CUI ELIMINA I LAYER. IL FILE VIENE CERCATO NELLA CARTELLA SOURCE\n\n2 - FILTRO PER ESTRAZIONE - LISTA DI ESPRESSIONI SEPARTE DA VIRGOLA UTILIZZATE PER TROVARE I LAYER DA ELIMINARE DAL FILE SORGENTE\nESEMPIO: VE.*,CPC.*,OCH.*",
  "confirm_merge": "PREMI IL PULSANTE PER CONFERMARE IL MERGE E CREARE UN FILE NELLA DIRECTORY SOURCE! STAI PER CREARE UN NUOVO FILE BASE... SE LO CHIAMERAI finale.pixil ANDRAI A SOVRASCRIVERE IL FILE ESISTENTE. SEI SICURO?",
  "operation_param_help": "Scegli operazione:\nread: scrive tutti i nomi dei layer in un file - Richiede un parametro\n\t-s (--source)\ngen: genera un'immagine in formato PNG - Richiede due parametri:\n\t-s (--source)\n\t-l (--layers)\nmerge: unisce due file PIXIL - Richiede tre parametri:\n\t-s (--source)\n\t-m (--merge)\n\t-p (--position)\next: estrae i layer dal file PIXIL - Richiede due parametri:\n\t-s (--source)\n\t-e (--extract)\ndel: elimina i layer dal file PIXIL - Richiede due parametri:\n\t-s (--source)\n\t-d (--delete)\nI file devono essere nella cartelle specifiche\n",
  "source_param_help": "Nome del file PIXIL da cui leggere i source\nEsempio: -s finale.pixil",
  "layers_param_help": "Nome del file da cui leggere i layers\nEsempio: -l mage_btc.json",
  "merge_param_help": "Nome del file PIXIL da cui leggere i layers da mergiare nel file source\nEsempio: -m bombette_ada.pixil",
  "position_param_help": "Indice al quale inserire i layer del merge, se si scrive 5 il primo layer sarà in posizione 6\nIl numero specifica quanti layer mettere \"dietro\"\nEsempio: -p 134",
  "extract_param_help": "Lista dei layer da estratte,\nVE.*BTC estrae tutti i vestiti di BTC\n.*BTC estrae tutte le risorse che terminano con BTCAC.* estrae tutti gli accessori\nEsempio: -e VE...BTC,.*_ADA",
  "del_param_help": "Lista dei layer da rimuovere,\nVE.*BTC rimuove tutti i vestiti di BTC\n.*BTC rimuove tutte le risorse che terminano con BTCAC.* rimuove tutti gli accessori\nEsempio: -d VE...BTC,.*_ADA"
}