{
  "read_lbl_help": "COMANDO READ\n\n\n---- DESCRIZIONE ----\nINDICA TUTTI I LAYER CONTENUTI IN UN FILE PIXIL\n\n\nRICHIEDE 1 PARAMETRO:\n\n1 - FILE SORGENTE - FILE PIXIL DA CUI LEGGERE TUTTI\nI LAYER. IL FILE VIENE CERCATO NELLA CARTELLA SOURCE",
  "gen_lbl_help": "COMANDO GEN\n\n\n---- DESCRIZIONE ----\nGENERA UN'IMMAGINE UTILIZZANDO UN FILE PIXIL COME\nBASE DA CUI LEGGERE TUTTI I LAYERE UN FILE JSON\nCOME TEMPLATE PER FILTRARE TUTTI I LAYER PRESENTI\nNEL FILE SORGENTE.QUESTI FILE PERMETTONO DI DEDICERE\nQUALI COMBINAZIONI SI POSSONO VERIFICARE\nDURANTE LA GENERAZIONE DELL'IMMAGINE.\nIL FILE FINALE VIENE INSERITO NELLA CARTELLA GEN\n\n\nRICHIEDE 2 PARAMETRI:\n\n1 - FILE SORGENTE - FILE PIXIL DA CUI LEGGERE TUTTI\nI LAYER. IL FILE VIENE CERCATO NELLA CARTELLA SOURCE\n\n2 - TEMPLATE JSON - FILE JSON DA UTILIZZARE PER\nFILTRARE I LAYER CONTENUTI NEL FILE SORGENTE\nIL FILE VIENE CERCATO NELLA CARTELLA TEMPLATE",
  "merge_lbl_help": "COMANDO MERGE\n\n\n---- DESCRIZIONE ----\nUNISCE I LAYER DI DUE FILE PIXIL IN UN\nUNICO FILE PIXIL, AGGIUNGE AD UN FILE BASE\nI LAYER CONTENUTI NEL FILE DA UNIRE.\nHA BISOGNO DI SAPERE IN QUALE POSIZIONE\nINSIRIRE I FILE. ESEMPIO:\nSE VIENE INDICATO 5, I LAYER AGGIUNTIVI\nVERRANNO MESSI DOPO I PRIMI 5 LAYER\nDEL FILE DI BASE, QUINDI IN POSIZIONE 6.\nIL FILE FINALE VIENE INSERITO NELL CARTELLA MERGE\n\n\nRICHIEDE 3 PARAMETRI:\n\n1 - FILE BASE - FILE PIXIL BASE AL QUALE AGGIUNGERE\nI LAYER. IL FILE VIENE CERCATO NELLA CARTELLA SOURCE\n\n2 - FILE AGGIUNTIVO - FILE PIXIL CHE CONTINE I LAYER\nDA AGGIUNGERE AL FILE BASE. IL FILE VIENE CERCATO\nNELLA CARTELLA SOURCE\n\n3 - POSZIONE DI INSERIMENTO - NUMERO CHE INDICA\nDA QUALE POSIZIONE INZIARE AD INSIRIRE I LAYER\nNEL FILE BASE",
  "ext_lbl_help": "COMANDO EXT\n\n\n---- DESCRIZIONE ----\nESTRAE DEI LAYER DA UN FILE PIXIL, NEL FILTRO\nPER L'ESTRAZIONE SI POSSONO UTILIZZARE\nESPRESSIONI REGOLARI, ALCUNI ESEMPI:\n\n.*BTC ESTRAE TUTTE LE RISORSE CHE TERMIANO CON BTC\nVE.* ESTARE TUTTE LE RISORSE CHE INIZIANO CON VE\nVE.*BTC ESTARE TUTTE LE RISORSE CHE INIZIANO\nCON VE E TERMINANO CON BTC\nIL FILE FINALE VIENE INSERITO NELL CARTELLA EXTRACT\n\n\nRICHIEDE 2  PARAMETRI:\n\n1 - FILE SORGENTE - FILE PIXIL DA CUI ESTRARRE I LAYER\nIL FILE VIENE CERCATO NELLA CARTELLA SOURCE\n\n2 - FILTRO PER ESTRAZIONE - LISTA DI ESPRESSIONI\nSEPARTE DA VIRGOLA UTILIZZATE PER FILTRARE\nI LAYER DEL FILE SORGENTE\nESEMPIO: VE.*,CPC.*,OCH.*",
  "del_lbl_help": "COMANDO DEL\n\n\n---- DESCRIZIONE ----\nCANCELLA DEI LAYER DA UN FILE PIXIL, NEL FILTRO\nPER L'ESTRAZIONE SI POSSONO UTILIZZARE\nESPRESSIONI REGOLARI, ALCUNI ESEMPI:\n\n.*BTC ELIMINA TUTTE LE RISORSE CHE TERMIANO CON BTC\nVE.* ELIMINA TUTTE LE RISORSE CHE INIZIANO CON VE\nVE.*BTC ELIMINA TUTTE LE RISORSE CHE INIZIANO\nCON VE E TERMINANO CON BTC\nIL FILE FINALE VIENE INSERITO NELL CARTELLA DELETE\n\n\nRICHIEDE 2  PARAMETRI:\n\n1 - FILE SORGENTE - FILE PIXIL DA CUI ELIMINA I LAYER\nIL FILE VIENE CERCATO NELLA CARTELLA SOURCE\n\n2 - FILTRO PER ESTRAZIONE - LISTA DI ESPRESSIONI\nSEPARTE DA VIRGOLA UTILIZZATE PER TROVARE\nI LAYER DA ELIMINARE DAL FILE SORGENTE\nESEMPIO: VE.*,CPC.*,OCH.*",
  "confirm_merge": "PREMI IL PULSANTE PER CONFERMARE IL MERGE E CREARE UN FILE\nNELLA DIRECTORY SOURCE! STAI PER CREARE UN NUOVO FILE BASE...\nSE LO CHIAMERAI finale.pixil ANDRAI A SOVRASCRIVERE IL FILE ESISTENTE.\nSEI SICURO?",
  "operation_param_help": "Scegli operazione:\nread: scrive tutti i nomi dei layer in un file - Richiede un parametro\n\t-s (--source)\ngen: genera un'immagine in formato PNG - Richiede due parametri:\n\t-s (--source)\n\t-l (--layers)\nmerge: unisce due file PIXIL - Richiede tre parametri:\n\t-s (--source)\n\t-m (--merge)\n\t-p (--position)\next: estrae i layer dal file PIXIL - Richiede due parametri:\n\t-s (--source)\n\t-e (--extract)\ndel: elimina i layer dal file PIXIL - Richiede due parametri:\n\t-s (--source)\n\t-d (--delete)\nI file devono essere nella cartelle specifiche\n",
  "source_param_help": "Nome del file PIXIL da cui leggere i source\nEsempio: -s finale.pixil",
  "layers_param_help": "Nome del file da cui leggere i layers\nEsempio: -l mage_btc.json",
  "merge_param_help": "Nome del file PIXIL da cui leggere i layers da mergiare nel file source\nEsempio: -m bombette_ada.pixil",
  "position_param_help": "Indice al quale inserire i layer del merge, se si scrive 5 il primo layer sarà in posizione 6\nIl numero specifica quanti layer mettere \"dietro\"\nEsempio: -p 134",
  "extract_param_help": "Lista dei layer da estratte,\nVE.*BTC estrae tutti i vestiti di BTC\n.*BTC estrae tutte le risorse che terminano con BTCAC.* estrae tutti gli accessori\nEsempio: -e VE...BTC,.*_ADA",
  "del_param_help": "Lista dei layer da rimuovere,\nVE.*BTC rimuove tutti i vestiti di BTC\n.*BTC rimuove tutte le risorse che terminano con BTCAC.* rimuove tutti gli accessori\nEsempio: -d VE...BTC,.*_ADA"
}